/*
===========================================================================================================================
===========================================================================================================================

کد خوب چطور کدی هستش ؟

1. خوانایی بالا (Readability)

خوانایی به این معناست که کد شما برای توسعه‌دهندگان دیگر (و حتی خودتان در آینده) ساده و قابل فهم باشد

کدی با خوانایی بالا، توسعه، رفع اشکال و نگهداری را سریع‌تر و آسان‌تر می‌کند

2. مقیاس‌پذیری (Scalability)

مقیاس‌پذیری به این معنا است که کد بتواند بدون کاهش کارایی یا پیچیدگی، با افزایش نیازها یا حجم داده‌ها به خوبی کار کند.

کدی که مقیاس‌پذیر باشد، قابلیت تطبیق با رشد پروژه یا تعداد کاربران بیشتر را دارد

===========================================================================================================================
===========================================================================================================================
*/