/*
===========================================================================================================================
===========================================================================================================================

Big O Notation :  ابزاری برای اندازه‌گیری و توصیف کارایی یک الگوریتم از نظر زمان اجرا یا میزان مصرف حافظه در بدترین حالت ممکن است

مشخص می‌کند که با افزایش اندازه ورودی (تعداد داده‌ها یا عناصر ورودی) زمان اجرا یا فضای مورد نیاز الگوریتم چگونه تغییر Big O به‌عبارتی

می‌کند این تحلیل به شما امکان می‌دهد الگوریتم‌ها را در شرایط مختلف ارزیابی و مقایسه کنید

Big O سه هدف اصلی : ==========================================================================================================

1 ) اندازه‌گیری زمان اجرا: بفهمیم زمان مورد نیاز یک الگوریتم برای انجام وظایف با افزایش داده‌ها چگونه تغییر می‌کند

2 ) اندازه‌گیری مصرف حافظه: مشخص کنیم الگوریتم چقدر فضای حافظه مصرف می‌کند

3 ) پیش‌بینی رفتار الگوریتم در بدترین حالت: تمرکز بر تحلیل شرایطی که الگوریتم با چالش‌برانگیزترین ورودی‌ها مواجه است

مهم است؟ Big O  چرا  ==========================================================================================================

1 ) مقایسه الگوریتم‌ها

به شما کمک می‌کند الگوریتم‌ها را بر اساس زمان اجرا یا مصرف حافظه با هم مقایسه کنید. مثلاً بین جستجوی خطی و جستجوی دودویی انتخاب کنید Big O 

عملکرد بهتری خواهد داشت O(n log n) در ورودی‌های بزرگ، الگوریتم O(n log n) داشته باشد و دیگری  O(n²) مثال: اگر الگوریتمی پیچیدگی

2 ) انتخاب بهترین راه‌حل

به شما اجازه می‌دهد الگوریتمی بهینه‌تر برای حل مشکلات خاص پیدا کنید مثال : در مرتب‌سازی  Big Oاستفاده از 

است O(n²) با پیچیدگی Bubble Sort معمولاً بهتر از O(n log n) با پیچیدگی Merge Sort   داده‌ها الگوریتم

3 ) پیش‌بینی رفتار الگوریتم‌ها:

می‌توانید رفتار الگوریتم‌ها را در ورودی‌های بزرگ پیش‌بینی کنید و تشخیص دهید که آیا الگوریتم شما برای Big O با تحلیل

باشد با افزایش ورودی زمان اجرا به سرعت افزایش O(2ⁿ)  مقیاس بزرگ مناسب است یا خیر. مثال: اگر الگوریتم شما

می‌یابد و ممکن است ناکارآمد باشد

مهم هستند؟ Big O چه چیزهایی در  =================================================================================================

1 ) اندازه ورودی (n):

برابر با تعداد عناصر آرایه است. n محاسبه می‌شود مثلاً در یک آرایه، (n) همواره بر اساس اندازه ورودی داده‌ها  Big O

2 ) رشد تابع :

به ما نشان می‌دهد که زمان اجرا یا فضای حافظه چگونه با افزایش ورودی رشد می‌کند. Big O

3 ) ساده‌سازی مقادیر کوچک:

فقط سریع‌ترین رشد اهمیت دارد و مقادیر ثابت یا موارد کم‌اهمیت نادیده گرفته می‌شوند
اهمیت بیشتری نسبت به مقدار ثابت ۳ دارد ۲ n ساده می‌شود، چون با افزایش ورودی  O(n)  به O(2n + 3) 


===========================================================================================================================
===========================================================================================================================
*/